_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_layer (InputLayer)     (None, 128)               0         
_________________________________________________________________
embedding_1 (Embedding)      (None, 128, 300)          8329800   
_________________________________________________________________
conv1d_1 (Conv1D)            (None, 128, 128)          115328    
_________________________________________________________________
max_pooling1d_1 (MaxPooling1 (None, 43, 128)           0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 43, 128)           0         
_________________________________________________________________
conv1d_2 (Conv1D)            (None, 43, 128)           49280     
_________________________________________________________________
max_pooling1d_2 (MaxPooling1 (None, 15, 128)           0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 15, 128)           0         
_________________________________________________________________
conv1d_3 (Conv1D)            (None, 15, 128)           49280     
_________________________________________________________________
global_max_pooling1d_1 (Glob (None, 128)               0         
_________________________________________________________________
output_layer (Dense)         (None, 3)                 387       
=================================================================
Total params: 8,544,075
Trainable params: 214,275
Non-trainable params: 8,329,800
_________________________________________________________________
