--- CNN Architecture Test
- Tested:
  - For: 10 folds and 100 epochs with early stopping
  - With: glove.840B.300d.txt, batch size 64, max features None, and max sequence length 128

x = Conv1D(32, 7, activation='relu')(x)
x = MaxPooling1D(5)(x)
x = Conv1D(32, 7, activation='relu')(x)
x = GlobalMaxPooling1D()(x)
	CV Results Summary:
	- val_loss mean and std: 0.67305 (+/- 0.01610)
	- val_acc mean and std: 0.72031 (+/- 0.00946)
	- loss mean and std: 0.52929 (+/- 0.10422)
	- acc mean and std: 0.78361 (+/- 0.04835)
	Layer (type)                 Output Shape              Param #   
	=================================================================
	input_layer (InputLayer)     (None, 128)               0         
	_________________________________________________________________
	embedding_11 (Embedding)     (None, 128, 300)          7783200   
	_________________________________________________________________
	conv1d_57 (Conv1D)           (None, 122, 32)           67232     
	_________________________________________________________________
	max_pooling1d_52 (MaxPooling (None, 24, 32)            0         
	_________________________________________________________________
	conv1d_58 (Conv1D)           (None, 18, 32)            7200      
	_________________________________________________________________
	global_max_pooling1d_1 (Glob (None, 32)                0         
	_________________________________________________________________
	output_layer (Dense)         (None, 3)                 99        
	=================================================================
	Total params: 7,857,731
	Trainable params: 74,531
	Non-trainable params: 7,783,200
	_________________________________________________________________

x = Conv1D(32, 7, activation='relu', padding='same')(x)
x = MaxPooling1D(5, padding='same')(x)
x = Conv1D(32, 7, activation='relu', padding='same')(x)
x = GlobalMaxPooling1D()(x)
	CV Results Summary:
	- val_loss mean and std: 0.60025 (+/- 0.02340)
	- val_acc mean and std: 0.75382 (+/- 0.01241)
	- loss mean and std: 0.46903 (+/- 0.05295)
	- acc mean and std: 0.81386 (+/- 0.02381)
	_________________________________________________________________
	Layer (type)                 Output Shape              Param #   
	=================================================================
	input_layer (InputLayer)     (None, 128)               0         
	_________________________________________________________________
	embedding_22 (Embedding)     (None, 128, 300)          7783200   
	_________________________________________________________________
	conv1d_79 (Conv1D)           (None, 128, 32)           67232     
	_________________________________________________________________
	max_pooling1d_63 (MaxPooling (None, 26, 32)            0         
	_________________________________________________________________
	conv1d_80 (Conv1D)           (None, 26, 32)            7200      
	_________________________________________________________________
	global_max_pooling1d_12 (Glo (None, 32)                0         
	_________________________________________________________________
	output_layer (Dense)         (None, 3)                 99        
	=================================================================
	Total params: 7,857,731
	Trainable params: 74,531
	Non-trainable params: 7,783,200
	_________________________________________________________________

x = Conv1D(128, 5, activation='relu', padding='same')(x)
x = MaxPooling1D(5, padding='same')(x)
x = Conv1D(128, 5, activation='relu', padding='same')(x)
x = MaxPooling1D(5, padding='same')(x)
x = Conv1D(128, 5, activation='relu', padding='same')(x)
x = MaxPooling1D(5, padding='same')(x)    
x = Flatten()(x)
x = Dense(128, activation='relu')(x)
	CV Results Summary:
	- val_loss mean and std: 0.57569 (+/- 0.03330)
	- val_acc mean and std: 0.76756 (+/- 0.01288)
	- loss mean and std: 0.51434 (+/- 0.12766)
	- acc mean and std: 0.78882 (+/- 0.06408)
	_________________________________________________________________
	Layer (type)                 Output Shape              Param #   
	=================================================================
	input_layer (InputLayer)     (None, 128)               0         
	_________________________________________________________________
	embedding_46 (Embedding)     (None, 128, 300)          7783200   
	_________________________________________________________________
	conv1d_141 (Conv1D)          (None, 128, 128)          192128    
	_________________________________________________________________
	max_pooling1d_102 (MaxPoolin (None, 26, 128)           0         
	_________________________________________________________________
	conv1d_142 (Conv1D)          (None, 26, 128)           82048     
	_________________________________________________________________
	max_pooling1d_103 (MaxPoolin (None, 6, 128)            0         
	_________________________________________________________________
	conv1d_143 (Conv1D)          (None, 6, 128)            82048     
	_________________________________________________________________
	max_pooling1d_104 (MaxPoolin (None, 2, 128)            0         
	_________________________________________________________________
	flatten_10 (Flatten)         (None, 256)               0         
	_________________________________________________________________
	dense_13 (Dense)             (None, 128)               32896     
	_________________________________________________________________
	output_layer (Dense)         (None, 3)                 387       
	=================================================================
	Total params: 8,172,707
	Trainable params: 389,507
	Non-trainable params: 7,783,200
	_________________________________________________________________

x = Conv1D(128, 5, activation='relu', padding='same')(x)
x = MaxPooling1D(5, padding='same')(x)
x = Conv1D(128, 5, activation='relu', padding='same')(x)
x = MaxPooling1D(5, padding='same')(x)
x = Conv1D(128, 5, activation='relu', padding='same')(x)
x = MaxPooling1D(5, padding='same')(x)
x = Conv1D(128, 5, activation='relu', padding='same')(x)
x = GlobalMaxPooling1D()(x)
	CV Results Summary:
	- val_loss mean and std: 0.58861 (+/- 0.01848)
	- val_acc mean and std: 0.76143 (+/- 0.01431)
	- loss mean and std: 0.47066 (+/- 0.11079)
	- acc mean and std: 0.80997 (+/- 0.05382)
	_________________________________________________________________
	Layer (type)                 Output Shape              Param #   
	=================================================================
	input_layer (InputLayer)     (None, 128)               0         
	_________________________________________________________________
	embedding_57 (Embedding)     (None, 128, 300)          7783200   
	_________________________________________________________________
	conv1d_174 (Conv1D)          (None, 128, 128)          192128    
	_________________________________________________________________
	max_pooling1d_135 (MaxPoolin (None, 26, 128)           0         
	_________________________________________________________________
	conv1d_175 (Conv1D)          (None, 26, 128)           82048     
	_________________________________________________________________
	max_pooling1d_136 (MaxPoolin (None, 6, 128)            0         
	_________________________________________________________________
	conv1d_176 (Conv1D)          (None, 6, 128)            82048     
	_________________________________________________________________
	max_pooling1d_137 (MaxPoolin (None, 2, 128)            0         
	_________________________________________________________________
	conv1d_177 (Conv1D)          (None, 2, 128)            82048     
	_________________________________________________________________
	global_max_pooling1d_34 (Glo (None, 128)               0         
	_________________________________________________________________
	output_layer (Dense)         (None, 3)                 387       
	=================================================================
	Total params: 8,221,859
	Trainable params: 438,659
	Non-trainable params: 7,783,200
	_________________________________________________________________

x = Conv1D(300, 5, activation='relu', padding='same')(x)
x = MaxPooling1D(5, padding='same')(x)
x = Conv1D(300, 5, activation='relu', padding='same')(x)
x = MaxPooling1D(5, padding='same')(x)
x = Conv1D(300, 5, activation='relu', padding='same')(x)
x = MaxPooling1D(5, padding='same')(x)
x = Flatten()(x)
x = Dense(300, activation='relu')(x)
	CV Results Summary:
	- val_loss mean and std: 0.56126 (+/- 0.03627)
	- val_acc mean and std: 0.77307 (+/- 0.01235)
	- loss mean and std: 0.49705 (+/- 0.11758)
	- acc mean and std: 0.79632 (+/- 0.06046)
	_________________________________________________________________
	Layer (type)                 Output Shape              Param #   
	=================================================================
	input_layer (InputLayer)     (None, 128)               0         
	_________________________________________________________________
	embedding_71 (Embedding)     (None, 128, 300)          7783200   
	_________________________________________________________________
	conv1d_229 (Conv1D)          (None, 128, 300)          450300    
	_________________________________________________________________
	max_pooling1d_177 (MaxPoolin (None, 26, 300)           0         
	_________________________________________________________________
	conv1d_230 (Conv1D)          (None, 26, 300)           450300    
	_________________________________________________________________
	max_pooling1d_178 (MaxPoolin (None, 6, 300)            0         
	_________________________________________________________________
	conv1d_231 (Conv1D)          (None, 6, 300)            450300    
	_________________________________________________________________
	max_pooling1d_179 (MaxPoolin (None, 2, 300)            0         
	_________________________________________________________________
	flatten_22 (Flatten)         (None, 600)               0         
	_________________________________________________________________
	dense_25 (Dense)             (None, 300)               180300    
	_________________________________________________________________
	output_layer (Dense)         (None, 3)                 903       
	=================================================================
	Total params: 9,315,303
	Trainable params: 1,532,103
	Non-trainable params: 7,783,200
	_________________________________________________________________

x = Conv1D(64, 3, activation='relu', padding='same')(x)
x = Conv1D(64, 3, activation='relu', padding='same')(x)
x = MaxPooling1D(3, padding='same')(x)
x = Conv1D(128, 3, activation='relu', padding='same')(x)
x = Conv1D(128, 3, activation='relu', padding='same')(x)
x = GlobalAveragePooling1D()(x)
x = Dropout(0.5)(x)
	CV Results Summary:
	- val_loss mean and std: 0.55125 (+/- 0.02336)
	- val_acc mean and std: 0.77992 (+/- 0.00784)
	- loss mean and std: 0.46090 (+/- 0.06928)
	- acc mean and std: 0.81824 (+/- 0.03012)
	_________________________________________________________________
	Layer (type)                 Output Shape              Param #   
	=================================================================
	input_layer (InputLayer)     (None, 128)               0         
	_________________________________________________________________
	embedding_109 (Embedding)    (None, 128, 300)          7783200   
	_________________________________________________________________
	conv1d_295 (Conv1D)          (None, 128, 64)           57664     
	_________________________________________________________________
	conv1d_296 (Conv1D)          (None, 128, 64)           12352     
	_________________________________________________________________
	max_pooling1d_243 (MaxPoolin (None, 43, 64)            0         
	_________________________________________________________________
	conv1d_297 (Conv1D)          (None, 43, 128)           24704     
	_________________________________________________________________
	conv1d_298 (Conv1D)          (None, 43, 128)           49280     
	_________________________________________________________________
	global_average_pooling1d_1 ( (None, 128)               0         
	_________________________________________________________________
	dropout_13 (Dropout)         (None, 128)               0         
	_________________________________________________________________
	output_layer (Dense)         (None, 3)                 387       
	=================================================================
	Total params: 7,927,587
	Trainable params: 144,387
	Non-trainable params: 7,783,200
	_________________________________________________________________

x = Conv1D(32, 3, activation='relu', padding='same')(x)
x = Conv1D(32, 3, activation='relu', padding='same')(x)
x = MaxPooling1D(2, padding='same')(x)
x = Dropout(0.25)(x)
x = Conv1D(64, 3, activation='relu', padding='same')(x)
x = Conv1D(64, 3, activation='relu', padding='same')(x)
x = MaxPooling1D(2, padding='same')(x)
x = Dropout(0.25)(x)
x = Flatten()(x)
x = Dense(256, activation='relu')(x)
x = Dropout(0.5)(x)
	CV Results Summary:
	- val_loss mean and std: 0.55634 (+/- 0.01538)
	- val_acc mean and std: 0.77164 (+/- 0.00925)
	- loss mean and std: 0.45311 (+/- 0.05732)
	- acc mean and std: 0.81857 (+/- 0.02529)
	_________________________________________________________________
	Layer (type)                 Output Shape              Param #   
	=================================================================
	input_layer (InputLayer)     (None, 128)               0         
	_________________________________________________________________
	embedding_120 (Embedding)    (None, 128, 300)          7783200   
	_________________________________________________________________
	conv1d_339 (Conv1D)          (None, 128, 32)           28832     
	_________________________________________________________________
	conv1d_340 (Conv1D)          (None, 128, 32)           3104      
	_________________________________________________________________
	max_pooling1d_254 (MaxPoolin (None, 64, 32)            0         
	_________________________________________________________________
	dropout_24 (Dropout)         (None, 64, 32)            0         
	_________________________________________________________________
	conv1d_341 (Conv1D)          (None, 64, 64)            6208      
	_________________________________________________________________
	conv1d_342 (Conv1D)          (None, 64, 64)            12352     
	_________________________________________________________________
	max_pooling1d_255 (MaxPoolin (None, 32, 64)            0         
	_________________________________________________________________
	dropout_25 (Dropout)         (None, 32, 64)            0         
	_________________________________________________________________
	flatten_56 (Flatten)         (None, 2048)              0         
	_________________________________________________________________
	dense_47 (Dense)             (None, 256)               524544    
	_________________________________________________________________
	dropout_26 (Dropout)         (None, 256)               0         
	_________________________________________________________________
	output_layer (Dense)         (None, 3)                 771       
	=================================================================
	Total params: 8,359,011
	Trainable params: 575,811
	Non-trainable params: 7,783,200
	_________________________________________________________________

x = Dropout(0.2)(x)
x = Conv1D(250, 3, activation='relu', padding='same')(x)
x = GlobalMaxPooling1D()(x)
x = Dense(250, activation='relu')(x)
x = Dropout(0.2)(x)
	CV Results Summary:
	- val_loss mean and std: 0.52041 (+/- 0.02724)
	- val_acc mean and std: 0.79090 (+/- 0.01167)
	- loss mean and std: 0.43228 (+/- 0.08265)
	- acc mean and std: 0.82568 (+/- 0.03545)
	_________________________________________________________________
	Layer (type)                 Output Shape              Param #   
	=================================================================
	input_layer (InputLayer)     (None, 128)               0         
	_________________________________________________________________
	embedding_131 (Embedding)    (None, 128, 300)          7783200   
	_________________________________________________________________
	dropout_57 (Dropout)         (None, 128, 300)          0         
	_________________________________________________________________
	conv1d_383 (Conv1D)          (None, 128, 250)          225250    
	_________________________________________________________________
	global_max_pooling1d_47 (Glo (None, 250)               0         
	_________________________________________________________________
	dense_58 (Dense)             (None, 250)               62750     
	_________________________________________________________________
	dropout_58 (Dropout)         (None, 250)               0         
	_________________________________________________________________
	output_layer (Dense)         (None, 3)                 753       
	=================================================================
	Total params: 8,071,953
	Trainable params: 288,753
	Non-trainable params: 7,783,200
	_________________________________________________________________
