_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_layer (InputLayer)     (None, 128)               0         
_________________________________________________________________
embedding_1 (Embedding)      (None, 128, 300)          8302800   
_________________________________________________________________
conv1d_1 (Conv1D)            (None, 128, 256)          230656    
_________________________________________________________________
conv1d_2 (Conv1D)            (None, 128, 256)          196864    
_________________________________________________________________
max_pooling1d_1 (MaxPooling1 (None, 26, 256)           0         
_________________________________________________________________
conv1d_3 (Conv1D)            (None, 26, 256)           196864    
_________________________________________________________________
conv1d_4 (Conv1D)            (None, 26, 256)           196864    
_________________________________________________________________
global_max_pooling1d_1 (Glob (None, 256)               0         
_________________________________________________________________
output_layer (Dense)         (None, 3)                 771       
=================================================================
Total params: 9,124,819
Trainable params: 822,019
Non-trainable params: 8,302,800
_________________________________________________________________
